assignment-1/assignment-1.tex
% Created 2026-01-12 Mon 19:57
% Intended LaTeX compiler: pdflatex
\documentclass[hidelinks, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\makeatletter \@ifpackageloaded{geometry}{\geometry{margin=2cm}}{\usepackage[margin=2cm]{geometry}} \makeatother
\def \homeworkNumber{1}
\usepackage{siunitx}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{mathtools}
\usepackage{circuitikz}
\usepackage{float}
\usepackage{karnaugh-map}
\usepackage[sfdefault]{plex-sans}
\usepackage{isomath}
\usepackage[italic]{mathastext}
\usepackage[scale=0.90]{plex-mono}
\usepackage{fancyhdr}
\pagestyle{fancyplain}
\chead{Assignment \homeworkNumber}
\lhead{Bach \textsc{Wongwandanee}}
\rhead{ECE 403}
\author{Waridh (Bach) Wongwandanee}
\date{\today}
\title{ECE 403 Assignment 1}
\hypersetup{
 pdfauthor={Waridh (Bach) Wongwandanee},
 pdftitle={ECE 403 Assignment 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\usepackage{biblatex}

\begin{document}

\section*{Question 1}
\label{sec:org876b172}
Find NPN, PNP, SCR (NPNP) devices in the process profile from CMOS
inverter cross section (next page; draw the 3 devices overtop of the CMOS
process cross-section) and propose a circuit technique to avoid CMOS SCR
latchup.
\section*{Question 2}
\label{sec:org4118e26}
Suppose you broke the loop between the PNP collector and NPN base of an
SCR: describe \(I_{Cpnp} = f \left( I_{Bnpn} \right)\) for this 2-BJT circuit with \(V_{DD} = \qty{1.2}{\volt}\), each with \(\beta = 10\). Describe what happens in the closed loop.
\section*{Question 3}
\label{sec:org85a2dbd}
Create a static CMOS schematic, and sticks layout of

\begin{verbatim}
x <= a NAND b; y <= b NAND c;
\end{verbatim}

Look at the two transistor schematics. Optimize and count the number of:
\begin{enumerate}
\item transistors
\item diffusion regions
\item metal-diffusion contacts
\end{enumerate}
\section*{Question 4}
\label{sec:org246bcf8}
Create a static CMOS schematic, and sticks layout of with the same
optimizations as before:

\begin{verbatim}
y <= NOT (( a OR b OR c) AND d);
\end{verbatim}
\end{document}
